---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.LayoutRuleClearSpacing
source: html/4679cad5-5e18-f0e3-8ee5-98a33762ef3b.htm
---
# LayoutRuleClearSpacing Members

Constructor of LayoutRuleFixedDistance. Create LayoutRuleFixedDistance with the values passed in.